mmame/esp32-music-player/firmware/player/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# 8 MB Octal PSRAM (ESP32-S3-WROOM-1 N16R8 / N8R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# Allow FreeRTOS tasks to be created with stack in external PSRAM (renamed in IDF 5.x)
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

# FAT Long File Names (shows full names instead of 8.3 format)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# The sonic element is pinned to core 1 and intentionally monopolises it.
# IDLE1 never runs by design; disable its WDT subscription to silence the
# "IDLE1 did not reset watchdog" error that would otherwise fire every 5 s.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
